## Work Plan
1. Load CSV files and perform data wrangling/EDA to clean data
2. Draw inferences and based off that plan what will be presented in Tableau
3. Transform the cleaned dataframe into a CSV file for Tableau use
4. Create Tableau Dashboard showing clear visualization of the data

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_attendance = pd.read_csv('attendance.csv')
df_homework = pd.read_csv('homework.csv')
df_performance = pd.read_csv('performance.csv')
df_students = pd.read_csv('students.csv')
df_communication = pd.read_csv('teacher_parent_communication.csv')

In [3]:
print(df_attendance.info())
print()
print(df_homework.info())
print()
print(df_performance.info())
print()
print(df_students.info())
print()
print(df_communication.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 364680 entries, 0 to 364679
Data columns (total 4 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Student_ID         364680 non-null  object
 1   Date               364680 non-null  object
 2   Subject            364680 non-null  object
 3   Attendance_Status  364680 non-null  object
dtypes: object(4)
memory usage: 11.1+ MB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60780 entries, 0 to 60779
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Student_ID          60780 non-null  object
 1   Subject             60780 non-null  object
 2   Assignment_Name     60780 non-null  object
 3   Due_Date            60780 non-null  object
 4   Status              60780 non-null  object
 5   Grade_Feedback      60780 non-null  object
 6   Guardian_Signature  60780 non-null  object
dtypes: object(7)
memory usage: 3.2+ MB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36468 entries, 0 to 36467
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Student_ID             36468 non-null  object
 1   Subject                36468 non-null  object
 2   Exam_Score             36468 non-null  int64
 3   Homework_Completion_%  36468 non-null  object
 4   Teacher_Comments       36468 non-null  object
dtypes: int64(1), object(4)
memory usage: 1.4+ MB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12156 entries, 0 to 12155
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Student_ID         12156 non-null  object
 1   Full_Name          12156 non-null  object
 2   Date_of_Birth      12156 non-null  object
 3   Grade_Level        12156 non-null  object
 4   Emergency_Contact  11538 non-null  object
dtypes: object(5)
memory usage: 475.0+ KB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24312 entries, 0 to 24311
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Student_ID       24312 non-null  object
 1   Date             24312 non-null  object
 2   Message_Type     24312 non-null  object
 3   Message_Content  24312 non-null  object
dtypes: object(4)
memory usage: 759.9+ KB
None

## Attendance

In [4]:
df_attendance.head()

  Student_ID        Date    Subject Attendance_Status
0     S06592  2024-09-20     Arabic           Present
1     S01777  2025-01-22       Math           Present
2     S07362  2024-12-03  Geography          PRESENT
3     S12119  2024-03-16  Geography           excused
4     S02002  2024-05-24       Math          PRESENT

## Homework

In [5]:
df_homework.head()

,Student_ID,Subject,Assignment_Name,Due_Date,Status,Grade_Feedback,Guardian_Signature
0,S12002,Science,Record.,2024-09-10,❌,C-,Yes
1,S01255,History,Head baby.,2024-10-16,❌,A+,No
2,S04968,Arabic,Keep audience medical free.,2025-02-11,Done,A+,Yes
3,S07925,Geography,Three half peace.,2024-10-03,Done,A+,
4,S09980,Geography,Assume particularly.,2024-12-01,✅,B-,No

## Performance

In [6]:
df_performance.head()

,Student_ID,Subject,Exam_Score,Homework_Completion_%,Teacher_Comments
0,S00396,Arabic,76,90,Possible I large perhaps onto impact pretty ag...
1,S06544,Math,91,100%,Attention very once light speak yeah against c...
2,S01277,Science,92,100%,Something piece phone wish rich these where ca...
3,S00686,English,40,90,Generation same story stand better father perf...
4,S10984,History,57,90,Minute board finally traditional clear result ...

## Students

In [7]:
df_students.head()

  Student_ID       Full_Name Date_of_Birth Grade_Level      Emergency_Contact
0     S00001  Donna Williams    2007-02-10     Grade 3      781-534-4258x9046
1     S00002   John Stafford    2014-11-26     Grade 5  +1-782-691-6291x99704
2     S00003     Chad Harper    2017-02-07     Grade 3           308.517.3750
3     S00004  Anthony Martin    11-10-2014     Grade 5       306-771-1524x116
4     S00005      Mary Stone    04-01-2016     Grade 3   +1-794-484-8495x7772

## Parent Teacher Communication

In [8]:
df_communication.head()

,Student_ID,Date,Message_Type,Message_Content
0,S01133,2025-01-20,Automated Reminder,Cut authority ball must cut to maintain think ...
1,S11179,2024-11-16,Parent to Teacher,Far baby different conference evening gas floo...
2,S09537,2024-12-03,Parent to Teacher,According this reality reality wish join seaso...
3,S00478,2025-01-25,Teacher to Parent,Feel article ever success choose serve forget ...
4,S04736,2024-10-15,Parent to Teacher,Friend wonder contain customer operation half ...

## EDA Attendance

In [9]:
df_attendance = df_attendance.sort_values(by = 'Student_ID', ascending= True)
df_attendance.head(10)

       Student_ID        Date    Subject Attendance_Status
346503     S00001  2024-06-20  Geography              Late
256270     S00001  2025-01-05       Math          PRESENT
187083     S00001  2024-07-06       Math              late
51354      S00001  2024-12-25    Science          PRESENT
181104     S00001  2024-08-07     Arabic           Present
31542      S00001  2024-12-02       Math          PRESENT
14296      S00001  2024-06-11    Science              late
205997     S00001  2024-06-26     Arabic        left early
270731     S00001  2024-03-18  Geography          PRESENT
130488     S00001  2024-09-16       Math           excused

In [10]:
df_attendance.head(10)

       Student_ID        Date    Subject Attendance_Status
346503     S00001  2024-06-20  Geography              Late
256270     S00001  2025-01-05       Math          PRESENT
187083     S00001  2024-07-06       Math              late
51354      S00001  2024-12-25    Science          PRESENT
181104     S00001  2024-08-07     Arabic           Present
31542      S00001  2024-12-02       Math          PRESENT
14296      S00001  2024-06-11    Science              late
205997     S00001  2024-06-26     Arabic        left early
270731     S00001  2024-03-18  Geography          PRESENT
130488     S00001  2024-09-16       Math           excused

In [11]:
df_attendance.nunique()

Student_ID           12156
Date                   366
Subject                  6
Attendance_Status        8
dtype: int64

In [12]:
df_attendance['Attendance_Status'].value_counts()

Attendance_Status
PRESENT       45982
Absent        45751
Present       45632
Late          45509
 late         45508
absnt         45478
left early    45435
excused       45385
Name: count, dtype: int64

In [13]:
df_attendance['Attendance_Status'] = df_attendance['Attendance_Status'].str.strip()
df_attendance['Attendance_Status'] = df_attendance['Attendance_Status'].replace({'PRESENT':'Present', 'late':'Late','absnt':'Absent', 'left early':'Left Early', 'excused':'Excused'})
df_attendance['Attendance_Status'].value_counts()

C:\Users\amrit\AppData\Local\Temp\ipykernel_38336\3931259186.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_attendance['Attendance_Status'].replace({'PRESENT':'Present', 'late':'Late','absnt':'Absent', 'left early':'Left Early', 'excused':'Excused'}, inplace = True)

Attendance_Status
Present       91614
Absent        91229
Late          91017
Left Early    45435
Excused       45385
Name: count, dtype: int64

In [14]:
df_attendance['Subject'].value_counts()

Subject
Math         61241
Science      60881
Arabic       60749
English      60684
Geography    60640
History      60485
Name: count, dtype: int64

In [15]:
df_attendance['Date'] = df_attendance['Date'].str.strip()
bad_rows = df_attendance[~df_attendance['Date'].str.match(r'^\d{4}-\d{2}-\d{2}$')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Date, Subject, Attendance_Status]
Index: []

In [16]:
df_attendance['Student_ID'] = df_attendance['Student_ID'].str.strip()
bad_rows = df_attendance[~df_attendance['Student_ID'].str.match(r'^S\d{5}$')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Date, Subject, Attendance_Status]
Index: []

In [17]:
df_attendance.duplicated().sum()

np.int64(515)

In [18]:
df_attendance.drop_duplicates(inplace = True)
df_attendance.duplicated().sum()

np.int64(0)

## Homework EDA

In [19]:
df_homework.sort_values('Student_ID', ascending = True, inplace = True)
df_homework.head(10)

,Student_ID,Subject,Assignment_Name,Due_Date,Status,Grade_Feedback,Guardian_Signature
6538,S00001,Arabic,Heavy consider process report.,10/02/2024,✔,B-,Yes
23213,S00001,Arabic,People audience.,2024-12-30,pending,B-,No
19018,S00001,English,Miss capital.,2025-01-22,not done,B,No
34572,S00002,Math,Culture claim.,2024-12-05,pending,F,No
60715,S00002,History,Level somebody by everyone.,2025-01-13,not done,F,
54136,S00002,English,Wrong enter chair.,2024-12-06,✔,B-,
59996,S00002,Geography,Mission medical.,2025-03-06,✔,A,
11854,S00003,Math,General participant.,2025-01-07,✔,B,
53662,S00003,Math,If message by.,2024-12-09,pending,B,No
36887,S00003,Math,Such lead around.,2025-02-27,✔,A+,No

In [20]:
df_homework.info()

<class 'pandas.core.frame.DataFrame'>
Index: 60780 entries, 6538 to 16881
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Student_ID          60780 non-null  object
 1   Subject             60780 non-null  object
 2   Assignment_Name     60780 non-null  object
 3   Due_Date            60780 non-null  object
 4   Status              60780 non-null  object
 5   Grade_Feedback      60780 non-null  object
 6   Guardian_Signature  60780 non-null  object
dtypes: object(7)
memory usage: 3.7+ MB

In [21]:
df_homework['Subject'].value_counts()

Subject
English      10209
Geography    10179
Science      10112
History      10110
Arabic       10106
Math         10064
Name: count, dtype: int64

In [22]:
df_homework['Assignment_Name'].value_counts()

Assignment_Name
Term.                     15
Also.                     15
Not.                      13
Understand.               13
Final.                    12
                          ..
Want like.                 1
Teacher crime listen.      1
Own blue other.            1
Certain cup growth.        1
How town west manager.     1
Name: count, Length: 56065, dtype: int64

In [23]:
df_homework['Due_Date'] = df_homework['Due_Date'].str.strip()
bad_rows = df_homework[~df_homework['Due_Date'].str.match(r'^\d{4}-\d{2}-\d{2}$')]
bad_rows

,Student_ID,Subject,Assignment_Name,Due_Date,Status,Grade_Feedback,Guardian_Signature
6538,S00001,Arabic,Heavy consider process report.,10/02/2024,✔,B-,Yes
15,S00004,English,Movement before.,03/02/2025,✔,C-,No
38135,S00005,History,Table scientist.,11/24/2024,✔,B,
49857,S00005,History,Rather war dream.,02/05/2025,✔,B,No
25708,S00006,English,Question tend local.,02/13/2025,pending,A,Yes
...,...,...,...,...,...,...,...
56044,S12152,Geography,Rock do.,01/31/2025,✔,F,No
54623,S12155,History,No participant environment.,11/07/2024,not done,A+,Yes
22757,S12155,Science,Sense land else.,02/09/2025,not done,C-,No
51758,S12155,Science,Likely season list.,11/05/2024,not done,C-,
5409,S12156,Math,Own blue other.,01/10/2025,✅,A,Yes

In [24]:
df_homework['Due_Date'] = df_homework['Due_Date'].str.replace(r'(\d{2})/(\d{2})/(\d{4})', r'\3-\1-\2', regex=True)
bad_rows = df_homework[~df_homework['Due_Date'].str.match(r'^\d{4}-\d{2}-\d{2}$')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Subject, Assignment_Name, Due_Date, Status, Grade_Feedback, Guardian_Signature]
Index: []

In [25]:
df_homework['Status'] = df_homework['Status'].str.strip()
df_homework['Status'].value_counts()

Status
Done        10278
not done    10234
❌           10151
✔           10090
pending     10014
✅           10013
Name: count, dtype: int64

In [26]:
df_homework['Status'] = df_homework['Status'].replace({'not done':'Not Done', '❌':'Not Done','✔':'Done','✅':'Done','pending':'Pending'})
df_homework['Status'].value_counts()

Status
Done        30381
Not Done    20385
Pending     10014
Name: count, dtype: int64

In [27]:
df_homework['Grade_Feedback'].value_counts()

Grade_Feedback
A+    7709
B-    7639
D     7631
B     7591
F     7586
C     7585
A     7533
C-    7506
Name: count, dtype: int64

In [28]:
df_homework['Guardian_Signature'].value_counts()

Guardian_Signature
No     20372
Yes    20348
       20060
Name: count, dtype: int64

In [29]:
df_homework['Guardian_Signature'] = df_homework['Guardian_Signature'].replace({' ':'Unknown'})
df_homework['Guardian_Signature'].value_counts()

Guardian_Signature
No         20372
Yes        20348
Unknown    20060
Name: count, dtype: int64

In [30]:
df_homework['Student_ID'] = df_homework['Student_ID'].str.strip()
bad_rows = df_homework[~df_homework['Student_ID'].str.match(r'^S\d{5}$')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Subject, Assignment_Name, Due_Date, Status, Grade_Feedback, Guardian_Signature]
Index: []

In [31]:
df_homework.isna().sum()

Student_ID            0
Subject               0
Assignment_Name       0
Due_Date              0
Status                0
Grade_Feedback        0
Guardian_Signature    0
dtype: int64

In [32]:
df_homework.duplicated().sum()

np.int64(0)

In [33]:
df_homework.head(10)

,Student_ID,Subject,Assignment_Name,Due_Date,Status,Grade_Feedback,Guardian_Signature
6538,S00001,Arabic,Heavy consider process report.,2024-10-02,Done,B-,Yes
23213,S00001,Arabic,People audience.,2024-12-30,Pending,B-,No
19018,S00001,English,Miss capital.,2025-01-22,Not Done,B,No
34572,S00002,Math,Culture claim.,2024-12-05,Pending,F,No
60715,S00002,History,Level somebody by everyone.,2025-01-13,Not Done,F,Unknown
54136,S00002,English,Wrong enter chair.,2024-12-06,Done,B-,Unknown
59996,S00002,Geography,Mission medical.,2025-03-06,Done,A,Unknown
11854,S00003,Math,General participant.,2025-01-07,Done,B,Unknown
53662,S00003,Math,If message by.,2024-12-09,Pending,B,No
36887,S00003,Math,Such lead around.,2025-02-27,Done,A+,No

## Performance EDA

In [34]:
df_performance.sort_values('Student_ID', ascending = True, inplace = True)
df_performance.head(10)

,Student_ID,Subject,Exam_Score,Homework_Completion_%,Teacher_Comments
34033,S00002,Arabic,69,-5,Season end color son page their begin return t...
19950,S00002,History,98,90,Sport beyond wait feel chair benefit section a...
29771,S00003,History,63,-5,Drive friend official house one approach troub...
33033,S00004,English,106,-5,Big everything sure identify happy church coun...
28150,S00004,History,59,90,Recognize tell arrive toward collection contin...
35530,S00005,Math,75,90,Well film deep hope gas respond write return a...
28340,S00005,History,78,80%,Eat garden affect it wide increase total cold ...
9290,S00005,Math,75,-5,Hold size remain day near sell player.
10108,S00005,English,78,90,Program control high part soldier edge any gar...
34836,S00005,Arabic,71,-5,Individual hit rule no consumer single season ...

In [35]:
df_performance.info()

<class 'pandas.core.frame.DataFrame'>
Index: 36468 entries, 34033 to 9147
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Student_ID             36468 non-null  object
 1   Subject                36468 non-null  object
 2   Exam_Score             36468 non-null  int64
 3   Homework_Completion_%  36468 non-null  object
 4   Teacher_Comments       36468 non-null  object
dtypes: int64(1), object(4)
memory usage: 1.7+ MB

In [36]:
df_performance['Subject'].value_counts()

Subject
Arabic       6224
Science      6093
Geography    6082
English      6043
Math         6035
History      5991
Name: count, dtype: int64

In [37]:
df_performance.rename(columns={'Homework_Completion_%':'Homework_Completion_Percentage'}, inplace = True)

In [38]:
df_performance['Homework_Completion_Percentage'].value_counts()

Homework_Completion_Percentage
95      7453
-5      7376
100%    7296
80%     7283
90      7060
Name: count, dtype: int64

In [39]:
df_performance['Homework_Completion_Percentage'] = df_performance['Homework_Completion_Percentage'].replace({'-5':'0','100%':'100','80%':'80'})
df_performance['Homework_Completion_Percentage'].value_counts()

Homework_Completion_Percentage
95     7453
0      7376
100    7296
80     7283
90     7060
Name: count, dtype: int64

In [40]:
df_performance['Homework_Completion_Percentage'] = df_performance['Homework_Completion_Percentage'].astype(int)

In [41]:
df_performance['Student_ID'] = df_performance['Student_ID'].str.strip()
bad_rows = df_performance[~df_performance['Student_ID'].str.match(r'^S\d{5}$')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Subject, Exam_Score, Homework_Completion_Percentage, Teacher_Comments]
Index: []

In [42]:
df_performance.isna().sum()

Student_ID                        0
Subject                           0
Exam_Score                        0
Homework_Completion_Percentage    0
Teacher_Comments                  0
dtype: int64

In [43]:
df_performance.duplicated().sum()

np.int64(0)

In [44]:
df_performance.info()

<class 'pandas.core.frame.DataFrame'>
Index: 36468 entries, 34033 to 9147
Data columns (total 5 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Student_ID                      36468 non-null  object
 1   Subject                         36468 non-null  object
 2   Exam_Score                      36468 non-null  int64
 3   Homework_Completion_Percentage  36468 non-null  int64
 4   Teacher_Comments                36468 non-null  object
dtypes: int64(2), object(3)
memory usage: 1.7+ MB

In [45]:
df_performance.head(10)

,Student_ID,Subject,Exam_Score,Homework_Completion_Percentage,Teacher_Comments
34033,S00002,Arabic,69,0,Season end color son page their begin return t...
19950,S00002,History,98,90,Sport beyond wait feel chair benefit section a...
29771,S00003,History,63,0,Drive friend official house one approach troub...
33033,S00004,English,106,0,Big everything sure identify happy church coun...
28150,S00004,History,59,90,Recognize tell arrive toward collection contin...
35530,S00005,Math,75,90,Well film deep hope gas respond write return a...
28340,S00005,History,78,80,Eat garden affect it wide increase total cold ...
9290,S00005,Math,75,0,Hold size remain day near sell player.
10108,S00005,English,78,90,Program control high part soldier edge any gar...
34836,S00005,Arabic,71,0,Individual hit rule no consumer single season ...

## Students EDA

In [46]:
df_students.sort_values('Student_ID', ascending = True, inplace = True)
df_students.head(10)

  Student_ID       Full_Name Date_of_Birth Grade_Level      Emergency_Contact
0     S00001  Donna Williams    2007-02-10     Grade 3      781-534-4258x9046
1     S00002   John Stafford    2014-11-26     Grade 5  +1-782-691-6291x99704
2     S00003     Chad Harper    2017-02-07     Grade 3           308.517.3750
3     S00004  Anthony Martin    11-10-2014     Grade 5       306-771-1524x116
4     S00005      Mary Stone    04-01-2016     Grade 3   +1-794-484-8495x7772
5     S00006       Joe Wells    2017-06-29     Grade 2    +1-933-864-5644x501
6     S00007  Margaret Nixon    2009-12-04     Grade 4       706.708.0421x412
7     S00008   James Wheeler    2011-01-25     Grade 1      (605)818-0057x877
8     S00009   Benjamin Cook    2007-10-04     Grade 4      (489)503-7511x611
9     S00010  Aaron Callahan    2012-02-18     Grade 4                    NaN

In [47]:
df_students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12156 entries, 0 to 12155
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Student_ID         12156 non-null  object
 1   Full_Name          12156 non-null  object
 2   Date_of_Birth      12156 non-null  object
 3   Grade_Level        12156 non-null  object
 4   Emergency_Contact  11538 non-null  object
dtypes: object(5)
memory usage: 475.0+ KB

In [49]:
df_students['Date_of_Birth'] = df_students['Date_of_Birth'].str.strip()
bad_rows = df_students[~df_students['Date_of_Birth'].str.match(r'^\d{4}-\d{2}-\d{2}')]
bad_rows

,Student_ID,Full_Name,Date_of_Birth,Grade_Level,Emergency_Contact
3,S00004,Anthony Martin,11-10-2014,Grade 5,306-771-1524x116
4,S00005,Mary Stone,04-01-2016,Grade 3,+1-794-484-8495x7772
22,S00023,Justin Sandoval,05-22-2016,Grade 1,898-679-5228
37,S00038,Brandi Carroll,04-09-2018,Grade 1,(939)450-3967x848
44,S00045,Melanie Martinez,07-03-2011,Grade 5,(733)606-6480
...,...,...,...,...,...
12080,S12081,Brian Evans,05-30-2015,Grade 3,3304048981
12111,S12112,Susan Durham,12-02-2011,Grade 2,+1-881-979-6451x79652
12112,S12113,Duane Morse,09-11-2010,Grade 4,(218)728-4504
12113,S12114,Kyle White,06-24-2008,Grade 5,684-400-0737
12137,S12138,Keith Wood,01-17-2015,Grade 2,625.766.1101

In [50]:
df_students['Date_of_Birth'] = df_students['Date_of_Birth'].str.replace(r'^(\d{2})-(\d{2})-(\d{4})$', r'\3-\1-\2', regex=True)
bad_rows = df_students[~df_students['Date_of_Birth'].str.match(r'^\d{4}-\d{2}-\d{2}')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Full_Name, Date_of_Birth, Grade_Level, Emergency_Contact]
Index: []

In [61]:
df_students['Student_ID'] = df_students['Student_ID'].str.strip()
bad_rows = df_students[~df_students['Student_ID'].str.match(r'^S\d{5}$')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Full_Name, Date_of_Birth, Grade_Level, Emergency_Contact]
Index: []

In [51]:
df_students['Grade_Level'].value_counts()

Grade_Level
Grade 5    2472
Grade 4    2454
Grade 3    2447
Grade 2    2400
Grade 1    2383
Name: count, dtype: int64

In [52]:
df_students['Emergency_Contact'] = df_students['Emergency_Contact'].str.strip()
df_students['Emergency_Contact'] = df_students['Emergency_Contact'].str.replace(r'\D', '', regex=True)         
df_students['Emergency_Contact'] = df_students['Emergency_Contact'].str[-10:]
df_students['Emergency_Contact'] = df_students['Emergency_Contact'].str.replace(r'(\d{3})(\d{3})(\d{4})', r'\1-\2-\3', regex=True)

In [53]:
df_students.head(15)

   Student_ID           Full_Name Date_of_Birth Grade_Level Emergency_Contact
0      S00001      Donna Williams    2007-02-10     Grade 3      344-258-9046
1      S00002       John Stafford    2014-11-26     Grade 5      162-919-9704
2      S00003         Chad Harper    2017-02-07     Grade 3      308-517-3750
3      S00004      Anthony Martin    2014-11-10     Grade 5      771-152-4116
4      S00005          Mary Stone    2016-04-01     Grade 3      848-495-7772
5      S00006           Joe Wells    2017-06-29     Grade 2      864-564-4501
6      S00007      Margaret Nixon    2009-12-04     Grade 4      708-042-1412
7      S00008       James Wheeler    2011-01-25     Grade 1      818-005-7877
8      S00009       Benjamin Cook    2007-10-04     Grade 4      503-751-1611
9      S00010      Aaron Callahan    2012-02-18     Grade 4               NaN
10     S00011  christopher church    2008-02-23     Grade 1               NaN
11     S00012      Jonathan Solis    2016-07-07     Grade 1      534-789-8656
12     S00013      Robert Sanders    2008-04-30     Grade 2      421-016-7779
13     S00014     Melanie Gilmore    2006-08-19     Grade 4      428-327-8506
14     S00015  Alexandria Wallace    2006-06-21     Grade 2      596-520-7061

In [55]:
df_students['Emergency_Contact'] = df_students['Emergency_Contact'].fillna('unknown')
df_students.head(15)

   Student_ID           Full_Name Date_of_Birth Grade_Level Emergency_Contact
0      S00001      Donna Williams    2007-02-10     Grade 3      344-258-9046
1      S00002       John Stafford    2014-11-26     Grade 5      162-919-9704
2      S00003         Chad Harper    2017-02-07     Grade 3      308-517-3750
3      S00004      Anthony Martin    2014-11-10     Grade 5      771-152-4116
4      S00005          Mary Stone    2016-04-01     Grade 3      848-495-7772
5      S00006           Joe Wells    2017-06-29     Grade 2      864-564-4501
6      S00007      Margaret Nixon    2009-12-04     Grade 4      708-042-1412
7      S00008       James Wheeler    2011-01-25     Grade 1      818-005-7877
8      S00009       Benjamin Cook    2007-10-04     Grade 4      503-751-1611
9      S00010      Aaron Callahan    2012-02-18     Grade 4           unknown
10     S00011  christopher church    2008-02-23     Grade 1           unknown
11     S00012      Jonathan Solis    2016-07-07     Grade 1      534-789-8656
12     S00013      Robert Sanders    2008-04-30     Grade 2      421-016-7779
13     S00014     Melanie Gilmore    2006-08-19     Grade 4      428-327-8506
14     S00015  Alexandria Wallace    2006-06-21     Grade 2      596-520-7061

In [58]:
df_students['Emergency_Contact'].value_counts()['unknown']

np.int64(618)

In [56]:
df_students.isna().sum()

Student_ID           0
Full_Name            0
Date_of_Birth        0
Grade_Level          0
Emergency_Contact    0
dtype: int64

In [57]:
df_students.duplicated().sum()

np.int64(0)

In [59]:
df_students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12156 entries, 0 to 12155
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Student_ID         12156 non-null  object
 1   Full_Name          12156 non-null  object
 2   Date_of_Birth      12156 non-null  object
 3   Grade_Level        12156 non-null  object
 4   Emergency_Contact  12156 non-null  object
dtypes: object(5)
memory usage: 475.0+ KB

## Parent Teacher Communication EDA

In [60]:
df_communication.sort_values('Student_ID', ascending = True, inplace = True)
df_communication.head(10)

,Student_ID,Date,Message_Type,Message_Content
11666,S00001,2024-12-06,Parent to Teacher,Almost herself sound service whole single gene...
15536,S00001,2024-11-28,Teacher to Parent,At month her remain listen thank million artic...
12650,S00001,2024-10-24,Automated Reminder,Institution most apply conference east trade i...
14516,S00002,2024-12-19,Automated Reminder,Federal south issue treat amount interesting o...
17043,S00002,2025-02-16,Teacher to Parent,Over model consider event say make wall not ma...
4285,S00002,2024-12-24,Teacher to Parent,Everyone require pretty decade accept wear mem...
11505,S00002,2025-03-05,Parent to Teacher,Improve candidate benefit kind item federal ot...
4173,S00004,2024-09-28,Parent to Teacher,Professor husband offer type fund join on beat...
214,S00004,2025-03-05,Automated Reminder,Air look for son mouth instead age sport vario...
14897,S00004,2025-02-15,Parent to Teacher,Low happen event white stay hospital onto read...

In [71]:
df_communication.info()

<class 'pandas.core.frame.DataFrame'>
Index: 24312 entries, 11666 to 12796
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Student_ID       24312 non-null  object
 1   Date             24312 non-null  object
 2   Message_Type     24312 non-null  object
 3   Message_Content  24312 non-null  object
dtypes: object(4)
memory usage: 949.7+ KB

In [72]:
df_communication['Student_ID'] = df_communication['Student_ID'].str.strip()
bad_rows = df_communication[~df_communication['Student_ID'].str.match(r'^S\d{5}$')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Date, Message_Type, Message_Content]
Index: []

In [69]:
df_communication['Date'] = df_communication['Date'].str.strip()
bad_rows = df_communication[~df_communication['Date'].str.match(r'^\d{4}-\d{2}-\d{2}')]
bad_rows

Empty DataFrame
Columns: [Student_ID, Date, Message_Type, Message_Content]
Index: []

In [70]:
df_communication['Message_Type'].value_counts()

Message_Type
Teacher to Parent     8149
Automated Reminder    8106
Parent to Teacher     8057
Name: count, dtype: int64

In [74]:
df_communication.isna().sum()

Student_ID         0
Date               0
Message_Type       0
Message_Content    0
dtype: int64

In [75]:
df_communication.duplicated().sum()

np.int64(0)

## Converting cleaned dataframes to csv files

In [84]:
df_attendance.to_csv('attendance_cleaned.csv', index = False)
df_homework.to_csv('homework_cleaned.csv', index = False)
df_performance.to_csv('performance_cleaned.csv', index = False)
df_students.to_csv('students_cleaned.csv', index = False)
df_communication.to_csv('teacher_parent_communication_cleaned.csv', index = False)